In [6]:
import  warnings
warnings.simplefilter('ignore')

import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import LabelEncoder

%matplotlib inline

In [8]:
cc_info = pd.read_csv('./cc_info.csv')

In [9]:
cc_info.head()

        credit_card      city state  zipcode  credit_card_limit
0  1280981422329509    Dallas    PA    18612               6000
1  9737219864179988   Houston    PA    15342              16000
2  4749889059323202    Auburn    MA     1501              14000
3  9591503562024072   Orlando    WV    26412              18000
4  2095640259001271  New York    NY    10001              20000

In [10]:
cc_info.isnull().sum()

credit_card          0
city                 0
state                0
zipcode              0
credit_card_limit    0
dtype: int64

In [11]:
for name in cc_info.columns:
    print('{0:15s}\t {1:5d}'.format(name,len(cc_info[name].unique())))

credit_card    	   984
city           	   124
state          	    35
zipcode        	   124
credit_card_limit	    28

In [12]:
cc_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 984 entries, 0 to 983
Data columns (total 5 columns):
credit_card          984 non-null int64
city                 984 non-null object
state                984 non-null object
zipcode              984 non-null int64
credit_card_limit    984 non-null int64
dtypes: int64(3), object(2)
memory usage: 38.5+ KB

In [14]:
transactions = pd.read_csv('./transactions.csv',parse_dates=['date'])

In [15]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 294588 entries, 0 to 294587
Data columns (total 5 columns):
credit_card                  294588 non-null int64
date                         294588 non-null datetime64[ns]
transaction_dollar_amount    294588 non-null float64
Long                         294588 non-null float64
Lat                          294588 non-null float64
dtypes: datetime64[ns](1), float64(3), int64(1)
memory usage: 11.2 MB

In [16]:
transactions.head()

,credit_card,date,transaction_dollar_amount,Long,Lat
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719

In [17]:
transactions.isnull().sum()

credit_card                  0
date                         0
transaction_dollar_amount    0
Long                         0
Lat                          0
dtype: int64

In [18]:
for name in transactions.columns:
    print('{0:15s}\t {1:5d}'.format(name,len(transactions[name].unique())))

credit_card    	   984
date           	 281065
transaction_dollar_amount	 30196
Long           	 294588
Lat            	 294588

# Data Processing

In [19]:
data = pd.merge(left=transactions,right=cc_info, on='credit_card',how='left')
data.head()

,credit_card,date,transaction_dollar_amount,Long,Lat,city,state,zipcode,credit_card_limit
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370,Houston,PA,15342,20000
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114,Houston,PA,15342,20000
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004,Houston,PA,15342,20000
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895,Houston,PA,15342,20000
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719,Houston,PA,15342,20000

In [20]:
# extract month, weekday, an hour information
data['month'] = data['date'].apply(lambda x: x.month)
data['day'] = data['date'].apply(lambda x: x.day)
data['weekday'] = data['date'].apply(lambda x: x.dayofweek)
data['hour'] = data['date'].apply(lambda x: x.hour)

In [21]:
# drop useless features
data = data.drop(labels='date',axis=1)
data.head()

,credit_card,transaction_dollar_amount,Long,Lat,city,state,zipcode,credit_card_limit,month,day,weekday,hour
0,1003715054175576,43.78,-80.174132,40.267370,Houston,PA,15342,20000,9,11,4,0
1,1003715054175576,103.15,-80.194240,40.180114,Houston,PA,15342,20000,10,24,5,22
2,1003715054175576,48.55,-80.211033,40.313004,Houston,PA,15342,20000,10,26,0,18
3,1003715054175576,136.18,-80.174138,40.290895,Houston,PA,15342,20000,10,22,3,19
4,1003715054175576,71.82,-80.238720,40.166719,Houston,PA,15342,20000,10,26,0,20

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 294588 entries, 0 to 294587
Data columns (total 12 columns):
credit_card                  294588 non-null int64
transaction_dollar_amount    294588 non-null float64
Long                         294588 non-null float64
Lat                          294588 non-null float64
city                         294588 non-null object
state                        294588 non-null object
zipcode                      294588 non-null int64
credit_card_limit            294588 non-null int64
month                        294588 non-null int64
day                          294588 non-null int64
weekday                      294588 non-null int64
hour                         294588 non-null int64
dtypes: float64(3), int64(7), object(2)
memory usage: 29.2+ MB

In [ ]:


# Q1

Your boss wants to identify those users that in your dataset never went above the
monthly credit card limit 􀀏􀁊alendar 􀁔onth􀀐. The goal of this is to automatically increase
their limit. Can you send him the list of Ids?

In [83]:
def monthly_transaction(df):
    total_trans = df['transaction_dollar_amount'].sum()
    credit_limit = df['credit_card_limit'].values[0]
    
    return pd.Series([total_trans, credit_limit],index=['total_transaction','credit_limit'])

In [84]:
# find user who never exceed limit
grouped = data.groupby(['credit_card','month']).apply(monthly_transaction)
grouped.head()

                        total_transaction  credit_limit
credit_card      month
1003715054175576 7                 162.56       20000.0
                 8                8441.51       20000.0
                 9               11281.56       20000.0
                 10               8954.21       20000.0
1013870087888817 7                 281.43       15000.0

In [85]:
grouped =grouped.reset_index()

In [86]:
grouped.head()

        credit_card  month  total_transaction  credit_limit
0  1003715054175576      7             162.56       20000.0
1  1003715054175576      8            8441.51       20000.0
2  1003715054175576      9           11281.56       20000.0
3  1003715054175576     10            8954.21       20000.0
4  1013870087888817      7             281.43       15000.0

In [87]:
grouped['exceed']=(grouped['total_transaction']>grouped['credit_limit']).astype(int)
grouped.head()

        credit_card  month  total_transaction  credit_limit  exceed
0  1003715054175576      7             162.56       20000.0       0
1  1003715054175576      8            8441.51       20000.0       0
2  1003715054175576      9           11281.56       20000.0       0
3  1003715054175576     10            8954.21       20000.0       0
4  1013870087888817      7             281.43       15000.0       0

In [88]:
grouped_sum = grouped.groupby('credit_card')['exceed'].sum().reset_index()
grouped_sum.head()

        credit_card  exceed
0  1003715054175576       0
1  1013870087888817       0
2  1023820165155391       0
3  1073931538936472       0
4  1077622576192810       0

In [89]:
lists = grouped_sum[grouped_sum['exceed']==0][['credit_card']]
print('Valid user:\t',len(lists))
lists.head()

Valid user:	 862

        credit_card
0  1003715054175576
1  1013870087888817
2  1023820165155391
3  1073931538936472
4  1077622576192810

So, there are 862 credit cards in total that never exceed their credit limit.

# Question 2

On the other hand, she wants you to implement an algorithm that as soon as a user goes above her monthly limit, it triggers an alert so that the user can be notified about that. We assume here that at the beginning of the new month, user total money spent gets reset to zero (i.e. she pays the card fully at the end of each month). Build a function that for each day, returns a list of users who went above their credit card monthly limit on that day.

In [90]:
def alert(data, month,day):
    data = data[(data['month']==month)&(data['day']<=day)]
    limit = data.groupby('credit_card')['credit_card_limit'].min().reset_index()
    transaction = data.groupby('credit_card')['transaction_dollar_amount'].sum().reset_index()
    
    merged = pd.merge(left=transaction,right=limit,on='credit_card',how='left')
    result = merged[merged['transaction_dollar_amount']>merged['credit_card_limit']]
    
    return result

In [92]:
# example 
alert(data,month=8,day=20)

          credit_card  transaction_dollar_amount  credit_card_limit
194  2850146878241916                    4012.81               4000
319  3936887050542904                    5352.07               4000
341  4118286032166087                    3416.52               3000
383  4462290711836916                    3119.53               2000
525  5723635641134781                    2161.30               2000
698  7299183791723634                    7074.49               7000
772  7850942767136368                    5704.00               4000
834  8522875529951473                    5860.89               5000
874  8972201384562696                    5266.08               5000

# Question 3

Finally, your boss is very concerned about frauds cause they are a huge cost for credit card companies. She wants you to implement an unsupervised algorithm that returns all transactions that seem unusual and are worth being investigated further.